{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_arange", 
      "name": "_arange0", 
      "attr": {
        "dtype": "float32", 
        "repeat": "1", 
        "start": "0", 
        "step": "1.0", 
        "stop": "480"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attr": {"shape": "(1, 1, 1, 480)"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to0", 
      "attr": {"shape": "(2, 1, 480, 480)"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar0", 
      "attr": {"scalar": "479.0"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attr": {"scalar": "2.0"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar0", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "_arange1", 
      "attr": {
        "dtype": "float32", 
        "repeat": "1", 
        "start": "0", 
        "step": "1.0", 
        "stop": "480"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attr": {"shape": "(1, 1, 480, 1)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to1", 
      "attr": {"shape": "(2, 1, 480, 480)"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar1", 
      "attr": {"scalar": "479.0"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attr": {"scalar": "2.0"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar1", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[6, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims0", 
      "attr": {"axis": "0"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to4", 
      "attr": {"shape": "(5, 2, 2, 480, 480)"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "_ones", 
      "name": "_ones0", 
      "attr": {
        "dtype": "float32", 
        "shape": "(5, 2, 1, 480, 480)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attr": {
        "dim": "2", 
        "num_args": "3"
      }, 
      "inputs": [[0, 0, 0], [15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape4", 
      "attr": {
        "reverse": "True", 
        "shape": "(-1, 0, 0, 0)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "econv1_weight", 
      "attr": {"__dtype__": "0"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "econv1_bias", 
      "attr": {
        "__dtype__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "econv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(7, 7)", 
        "no_bias": "False", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "(5, 5)", 
        "workspace": "256"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "econv1_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel0", 
      "attr": {
        "axis": "0", 
        "num_outputs": "5"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_0_i2h_weight", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_0_i2h_bias", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t4_i2h", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "[3, 3]", 
        "num_filter": "192", 
        "pad": "[1, 1]", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 4, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel9", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t3_i2h", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "[3, 3]", 
        "num_filter": "192", 
        "pad": "[1, 1]", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 3, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel7", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t2_i2h", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "[3, 3]", 
        "num_filter": "192", 
        "pad": "[1, 1]", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 2, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel5", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t1_i2h", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "[3, 3]", 
        "num_filter": "192", 
        "pad": "[1, 1]", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 1, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel3", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t0_i2h", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "[3, 3]", 
        "num_filter": "192", 
        "pad": "[1, 1]", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel1", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_begin_state_h", 
      "attr": {
        "__layout__": "NCHW", 
        "__shape__": "(2, 64, 96, 96)"
      }, 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attr": {
        "axis": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_0_i2f_conv1_weight", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_0_i2f_conv1_bias", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t0_i2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[23, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_0_h2f_conv1_weight", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_0_h2f_conv1_bias", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t0_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[37, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[40, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu0", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_0_f_out_weight", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_0_f_out_bias", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "26", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split1", 
      "attr": {
        "axis": "1", 
        "num_outputs": "13"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar4", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator0", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler0", 
      "inputs": [[37, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar5", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator1", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler1", 
      "inputs": [[37, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar6", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator2", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler2", 
      "inputs": [[37, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar7", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator3", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler3", 
      "inputs": [[37, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar8", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator4", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler4", 
      "inputs": [[37, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar9", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator5", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler5", 
      "inputs": [[37, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar10", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator6", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler6", 
      "inputs": [[37, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar11", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator7", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler7", 
      "inputs": [[37, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar12", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator8", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler8", 
      "inputs": [[37, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar13", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 9, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator9", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler9", 
      "inputs": [[37, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar14", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 10, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator10", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler10", 
      "inputs": [[37, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar15", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 11, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator11", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler11", 
      "inputs": [[37, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar16", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[49, 12, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator12", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler12", 
      "inputs": [[37, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attr": {
        "dim": "1", 
        "num_args": "13"
      }, 
      "inputs": [
        [52, 0, 0], 
        [55, 0, 0], 
        [58, 0, 0], 
        [61, 0, 0], 
        [64, 0, 0], 
        [67, 0, 0], 
        [70, 0, 0], 
        [73, 0, 0], 
        [76, 0, 0], 
        [79, 0, 0], 
        [82, 0, 0], 
        [85, 0, 0], 
        [88, 0, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_0_h2h_weight", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ebrnn1_0_h2h_bias", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t0_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "192"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel2", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[35, 1, 0], [93, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ebrnn1_0__t0_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[95, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar0", 
      "attr": {"scalar": "1"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[35, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ebrnn1_0__t0_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[99, 0, 0], [93, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[35, 2, 0], [100, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ebrnn1_0__t0_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[97, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[96, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t1_i2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[23, 1, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t1_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[104, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "26", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[108, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split2", 
      "attr": {
        "axis": "1", 
        "num_outputs": "13"
      }, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar17", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator13", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler13", 
      "inputs": [[104, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar18", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator14", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler14", 
      "inputs": [[104, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar19", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator15", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler15", 
      "inputs": [[104, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar20", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator16", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler16", 
      "inputs": [[104, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar21", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator17", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler17", 
      "inputs": [[104, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar22", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator18", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler18", 
      "inputs": [[104, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar23", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator19", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler19", 
      "inputs": [[104, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar24", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator20", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler20", 
      "inputs": [[104, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar25", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator21", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler21", 
      "inputs": [[104, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar26", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 9, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator22", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler22", 
      "inputs": [[104, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar27", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 10, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator23", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler23", 
      "inputs": [[104, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar28", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 11, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator24", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler24", 
      "inputs": [[104, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar29", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[110, 12, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator25", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler25", 
      "inputs": [[104, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attr": {
        "dim": "1", 
        "num_args": "13"
      }, 
      "inputs": [
        [113, 0, 0], 
        [116, 0, 0], 
        [119, 0, 0], 
        [122, 0, 0], 
        [125, 0, 0], 
        [128, 0, 0], 
        [131, 0, 0], 
        [134, 0, 0], 
        [137, 0, 0], 
        [140, 0, 0], 
        [143, 0, 0], 
        [146, 0, 0], 
        [149, 0, 0]
      ]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t1_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "192"
      }, 
      "inputs": [[150, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel4", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[33, 1, 0], [152, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ebrnn1_0__t1_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul4", 
      "inputs": [[154, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar1", 
      "attr": {"scalar": "1"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[33, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ebrnn1_0__t1_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[158, 0, 0], [152, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[33, 2, 0], [159, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ebrnn1_0__t1_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[156, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[155, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t2_i2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[23, 2, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t2_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[163, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu2", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "26", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[167, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split3", 
      "attr": {
        "axis": "1", 
        "num_outputs": "13"
      }, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar30", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator26", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler26", 
      "inputs": [[163, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar31", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator27", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler27", 
      "inputs": [[163, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar32", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator28", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler28", 
      "inputs": [[163, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar33", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator29", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler29", 
      "inputs": [[163, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar34", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator30", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler30", 
      "inputs": [[163, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar35", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator31", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler31", 
      "inputs": [[163, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar36", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator32", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler32", 
      "inputs": [[163, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar37", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator33", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler33", 
      "inputs": [[163, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar38", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator34", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler34", 
      "inputs": [[163, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar39", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 9, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator35", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler35", 
      "inputs": [[163, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar40", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 10, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator36", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler36", 
      "inputs": [[163, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar41", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 11, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator37", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler37", 
      "inputs": [[163, 0, 0], [204, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar42", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[169, 12, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator38", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler38", 
      "inputs": [[163, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat5", 
      "attr": {
        "dim": "1", 
        "num_args": "13"
      }, 
      "inputs": [
        [172, 0, 0], 
        [175, 0, 0], 
        [178, 0, 0], 
        [181, 0, 0], 
        [184, 0, 0], 
        [187, 0, 0], 
        [190, 0, 0], 
        [193, 0, 0], 
        [196, 0, 0], 
        [199, 0, 0], 
        [202, 0, 0], 
        [205, 0, 0], 
        [208, 0, 0]
      ]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t2_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "192"
      }, 
      "inputs": [[209, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel6", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[31, 1, 0], [211, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ebrnn1_0__t2_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul7", 
      "inputs": [[213, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar2", 
      "attr": {"scalar": "1"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[31, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ebrnn1_0__t2_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul6", 
      "inputs": [[217, 0, 0], [211, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[31, 2, 0], [218, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ebrnn1_0__t2_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul8", 
      "inputs": [[215, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[214, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t3_i2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[23, 3, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t3_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[222, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[223, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu3", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "26", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[226, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split4", 
      "attr": {
        "axis": "1", 
        "num_outputs": "13"
      }, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar43", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator39", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler39", 
      "inputs": [[222, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar44", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator40", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler40", 
      "inputs": [[222, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar45", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator41", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler41", 
      "inputs": [[222, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar46", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator42", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler42", 
      "inputs": [[222, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar47", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator43", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler43", 
      "inputs": [[222, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar48", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator44", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler44", 
      "inputs": [[222, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar49", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator45", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler45", 
      "inputs": [[222, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar50", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator46", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler46", 
      "inputs": [[222, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar51", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator47", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler47", 
      "inputs": [[222, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar52", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 9, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator48", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler48", 
      "inputs": [[222, 0, 0], [257, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar53", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 10, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator49", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler49", 
      "inputs": [[222, 0, 0], [260, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar54", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 11, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator50", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler50", 
      "inputs": [[222, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar55", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[228, 12, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator51", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[265, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler51", 
      "inputs": [[222, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat6", 
      "attr": {
        "dim": "1", 
        "num_args": "13"
      }, 
      "inputs": [
        [231, 0, 0], 
        [234, 0, 0], 
        [237, 0, 0], 
        [240, 0, 0], 
        [243, 0, 0], 
        [246, 0, 0], 
        [249, 0, 0], 
        [252, 0, 0], 
        [255, 0, 0], 
        [258, 0, 0], 
        [261, 0, 0], 
        [264, 0, 0], 
        [267, 0, 0]
      ]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t3_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "192"
      }, 
      "inputs": [[268, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel8", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[29, 1, 0], [270, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ebrnn1_0__t3_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[271, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul10", 
      "inputs": [[272, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar3", 
      "attr": {"scalar": "1"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[29, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "ebrnn1_0__t3_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul9", 
      "inputs": [[276, 0, 0], [270, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[29, 2, 0], [277, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ebrnn1_0__t3_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul11", 
      "inputs": [[274, 0, 0], [279, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[273, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t4_i2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[23, 4, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ebrnn1_0__t4_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[281, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus20", 
      "inputs": [[282, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu4", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "26", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[285, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split5", 
      "attr": {
        "axis": "1", 
        "num_outputs": "13"
      }, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar56", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator52", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler52", 
      "inputs": [[281, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar57", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator53", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler53", 
      "inputs": [[281, 0, 0], [292, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar58", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator54", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler54", 
      "inputs": [[281, 0, 0], [295, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar59", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator55", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler55", 
      "inputs": [[281, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar60", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator56", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler56", 
      "inputs": [[281, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar61", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator57", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler57", 
      "inputs": [[281, 0, 0], [304, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar62", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator58", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler58", 
      "inputs": [[281, 0, 0], [307, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar63", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator59", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[309, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler59", 
      "inputs": [[281, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar64", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator60", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler60", 
      "inputs": [[281, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar65", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 9, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator61", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler61", 
      "inputs": [[281, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar66", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 10, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator62", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler62", 
      "inputs": [[281, 0, 0], [319, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar67", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 11, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator63", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[321, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler63", 
      "inputs": [[281, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar68", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[287, 12, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator64", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler64", 
      "inputs": [[281, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat7", 
      "attr": {
        "dim": "1", 
        "num_args": "13"
      }, 
      "inputs": [
        [290, 0, 0], 
        [293, 0, 0], 
        [296, 0, 0], 
        [299, 0, 0], 
        [302, 0, 0], 
        [305, 0, 0], 
        [308, 0, 0], 
        [311, 0, 0], 
        [314, 0, 0], 
        [317, 0, 0], 
        [320, 0, 0], 
