{
  "nodes": [
    {
      "op": "null", 
      "name": "fbrnn3_begin_state_h", 
      "attr": {
        "__layout__": "NCHW", 
        "__shape__": "(2, 192, 16, 16)"
      }, 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "split20", 
      "attr": {
        "axis": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fbrnn3_0_h2f_conv1_weight", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fbrnn3_0_h2f_conv1_bias", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t0_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu15", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fbrnn3_0_f_out_weight", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fbrnn3_0_f_out_bias", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "18", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split21", 
      "attr": {
        "axis": "1", 
        "num_outputs": "9"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar179", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator175", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler175", 
      "inputs": [[1, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar180", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[9, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator176", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler176", 
      "inputs": [[1, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar181", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[9, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator177", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler177", 
      "inputs": [[1, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar182", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[9, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator178", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler178", 
      "inputs": [[1, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar183", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[9, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator179", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler179", 
      "inputs": [[1, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar184", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[9, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator180", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler180", 
      "inputs": [[1, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar185", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[9, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator181", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler181", 
      "inputs": [[1, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar186", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[9, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator182", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler182", 
      "inputs": [[1, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar187", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[9, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator183", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler183", 
      "inputs": [[1, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat23", 
      "attr": {
        "dim": "1", 
        "num_args": "9"
      }, 
      "inputs": [[12, 0, 0], [15, 0, 0], [18, 0, 0], [21, 0, 0], [24, 0, 0], [27, 0, 0], [30, 0, 0], [33, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fbrnn3_0_h2h_weight", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fbrnn3_0_h2h_bias", 
      "attr": {"__lr_mult__": "1.0"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t0_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "576"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel33", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t0_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[41, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul46", 
      "inputs": [[42, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar15", 
      "attr": {"scalar": "1"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t0_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul45", 
      "inputs": [[45, 0, 0], [41, 2, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "fbrnn3_0__t0_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul47", 
      "inputs": [[44, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus75", 
      "inputs": [[43, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t1_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[49, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu16", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "18", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[51, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split22", 
      "attr": {
        "axis": "1", 
        "num_outputs": "9"
      }, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar188", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator184", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler184", 
      "inputs": [[49, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar189", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[53, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator185", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler185", 
      "inputs": [[49, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar190", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[53, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator186", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler186", 
      "inputs": [[49, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar191", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[53, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator187", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler187", 
      "inputs": [[49, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar192", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[53, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator188", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler188", 
      "inputs": [[49, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar193", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[53, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator189", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler189", 
      "inputs": [[49, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar194", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[53, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator190", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler190", 
      "inputs": [[49, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar195", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[53, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator191", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler191", 
      "inputs": [[49, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar196", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[53, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator192", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler192", 
      "inputs": [[49, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat24", 
      "attr": {
        "dim": "1", 
        "num_args": "9"
      }, 
      "inputs": [[56, 0, 0], [59, 0, 0], [62, 0, 0], [65, 0, 0], [68, 0, 0], [71, 0, 0], [74, 0, 0], [77, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t1_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "576"
      }, 
      "inputs": [[81, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel34", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t1_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[83, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul49", 
      "inputs": [[84, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar16", 
      "attr": {"scalar": "1"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t1_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul48", 
      "inputs": [[87, 0, 0], [83, 2, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "fbrnn3_0__t1_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul50", 
      "inputs": [[86, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus76", 
      "inputs": [[85, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t2_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[91, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu17", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "18", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[93, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split23", 
      "attr": {
        "axis": "1", 
        "num_outputs": "9"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar197", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator193", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler193", 
      "inputs": [[91, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar198", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[95, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator194", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler194", 
      "inputs": [[91, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar199", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[95, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator195", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler195", 
      "inputs": [[91, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar200", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[95, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator196", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler196", 
      "inputs": [[91, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar201", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[95, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator197", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler197", 
      "inputs": [[91, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar202", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[95, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator198", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler198", 
      "inputs": [[91, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar203", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[95, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator199", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler199", 
      "inputs": [[91, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar204", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[95, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator200", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler200", 
      "inputs": [[91, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar205", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[95, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator201", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler201", 
      "inputs": [[91, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat25", 
      "attr": {
        "dim": "1", 
        "num_args": "9"
      }, 
      "inputs": [[98, 0, 0], [101, 0, 0], [104, 0, 0], [107, 0, 0], [110, 0, 0], [113, 0, 0], [116, 0, 0], [119, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t2_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "576"
      }, 
      "inputs": [[123, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel35", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t2_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[125, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul52", 
      "inputs": [[126, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar17", 
      "attr": {"scalar": "1"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t2_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul51", 
      "inputs": [[129, 0, 0], [125, 2, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "fbrnn3_0__t2_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul53", 
      "inputs": [[128, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus77", 
      "inputs": [[127, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t3_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[133, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu18", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "18", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[135, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split24", 
      "attr": {
        "axis": "1", 
        "num_outputs": "9"
      }, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar206", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator202", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler202", 
      "inputs": [[133, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar207", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[137, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator203", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler203", 
      "inputs": [[133, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar208", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[137, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator204", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler204", 
      "inputs": [[133, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar209", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[137, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator205", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler205", 
      "inputs": [[133, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar210", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[137, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator206", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler206", 
      "inputs": [[133, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar211", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[137, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator207", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler207", 
      "inputs": [[133, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar212", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[137, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator208", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler208", 
      "inputs": [[133, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar213", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[137, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator209", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler209", 
      "inputs": [[133, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar214", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[137, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator210", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler210", 
      "inputs": [[133, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat26", 
      "attr": {
        "dim": "1", 
        "num_args": "9"
      }, 
      "inputs": [[140, 0, 0], [143, 0, 0], [146, 0, 0], [149, 0, 0], [152, 0, 0], [155, 0, 0], [158, 0, 0], [161, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t3_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "576"
      }, 
      "inputs": [[165, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel36", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t3_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul55", 
      "inputs": [[168, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar18", 
      "attr": {"scalar": "1"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t3_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul54", 
      "inputs": [[171, 0, 0], [167, 2, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "fbrnn3_0__t3_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul56", 
      "inputs": [[170, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus78", 
      "inputs": [[169, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t4_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[175, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu19", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "18", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[177, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split25", 
      "attr": {
        "axis": "1", 
        "num_outputs": "9"
      }, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar215", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator211", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler211", 
      "inputs": [[175, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar216", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[179, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator212", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler212", 
      "inputs": [[175, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar217", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[179, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator213", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler213", 
      "inputs": [[175, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar218", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[179, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator214", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler214", 
      "inputs": [[175, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar219", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[179, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator215", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler215", 
      "inputs": [[175, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar220", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[179, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator216", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler216", 
      "inputs": [[175, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar221", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[179, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator217", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler217", 
      "inputs": [[175, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar222", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[179, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator218", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler218", 
      "inputs": [[175, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar223", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[179, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator219", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler219", 
      "inputs": [[175, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat27", 
      "attr": {
        "dim": "1", 
        "num_args": "9"
      }, 
      "inputs": [[182, 0, 0], [185, 0, 0], [188, 0, 0], [191, 0, 0], [194, 0, 0], [197, 0, 0], [200, 0, 0], [203, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t4_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "576"
      }, 
      "inputs": [[207, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel37", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t4_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[209, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul58", 
      "inputs": [[210, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar19", 
      "attr": {"scalar": "1"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t4_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul57", 
      "inputs": [[213, 0, 0], [209, 2, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "fbrnn3_0__t4_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul59", 
      "inputs": [[212, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus79", 
      "inputs": [[211, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t5_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[217, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu20", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "18", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[219, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split26", 
      "attr": {
        "axis": "1", 
        "num_outputs": "9"
      }, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar224", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator220", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler220", 
      "inputs": [[217, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar225", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[221, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator221", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler221", 
      "inputs": [[217, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar226", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[221, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator222", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler222", 
      "inputs": [[217, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar227", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[221, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator223", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler223", 
      "inputs": [[217, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar228", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[221, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator224", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler224", 
      "inputs": [[217, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar229", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[221, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator225", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler225", 
      "inputs": [[217, 0, 0], [238, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar230", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[221, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator226", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler226", 
      "inputs": [[217, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar231", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[221, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator227", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler227", 
      "inputs": [[217, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar232", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[221, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator228", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler228", 
      "inputs": [[217, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat28", 
      "attr": {
        "dim": "1", 
        "num_args": "9"
      }, 
      "inputs": [[224, 0, 0], [227, 0, 0], [230, 0, 0], [233, 0, 0], [236, 0, 0], [239, 0, 0], [242, 0, 0], [245, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t5_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "576"
      }, 
      "inputs": [[249, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel38", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t5_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[251, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul61", 
      "inputs": [[252, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar20", 
      "attr": {"scalar": "1"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t5_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul60", 
      "inputs": [[255, 0, 0], [251, 2, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "fbrnn3_0__t5_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul62", 
      "inputs": [[254, 0, 0], [257, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus80", 
      "inputs": [[253, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t6_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[259, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu21", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "18", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[261, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split27", 
      "attr": {
        "axis": "1", 
        "num_outputs": "9"
      }, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar233", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator229", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler229", 
      "inputs": [[259, 0, 0], [265, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar234", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[263, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator230", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[267, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler230", 
      "inputs": [[259, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar235", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[263, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator231", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler231", 
      "inputs": [[259, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar236", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[263, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator232", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler232", 
      "inputs": [[259, 0, 0], [274, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar237", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[263, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator233", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler233", 
      "inputs": [[259, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar238", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[263, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator234", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler234", 
      "inputs": [[259, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar239", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[263, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator235", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler235", 
      "inputs": [[259, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar240", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[263, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator236", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[285, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler236", 
      "inputs": [[259, 0, 0], [286, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar241", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[263, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator237", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler237", 
      "inputs": [[259, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat29", 
      "attr": {
        "dim": "1", 
        "num_args": "9"
      }, 
      "inputs": [[266, 0, 0], [269, 0, 0], [272, 0, 0], [275, 0, 0], [278, 0, 0], [281, 0, 0], [284, 0, 0], [287, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t6_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "576"
      }, 
      "inputs": [[291, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel39", 
      "attr": {
        "axis": "1", 
        "num_outputs": "3"
      }, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t6_u", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[293, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul64", 
      "inputs": [[294, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar21", 
      "attr": {"scalar": "1"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "fbrnn3_0__t6_r", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[293, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul63", 
      "inputs": [[297, 0, 0], [293, 2, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "fbrnn3_0__t6_h_leaky", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul65", 
      "inputs": [[296, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus81", 
      "inputs": [[295, 0, 0], [300, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t7_h2f_conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "num_filter": "32", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[301, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu22", 
      "attr": {"slope": "0.2"}, 
      "inputs": [[302, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "18", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[303, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split28", 
      "attr": {
        "axis": "1", 
        "num_outputs": "9"
      }, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar242", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator238", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler238", 
      "inputs": [[301, 0, 0], [307, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar243", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[305, 1, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator239", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[309, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler239", 
      "inputs": [[301, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar244", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[305, 2, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator240", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler240", 
      "inputs": [[301, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar245", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[305, 3, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator241", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler241", 
      "inputs": [[301, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar246", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[305, 4, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator242", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler242", 
      "inputs": [[301, 0, 0], [319, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar247", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[305, 5, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator243", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[321, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler243", 
      "inputs": [[301, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar248", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[305, 6, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator244", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler244", 
      "inputs": [[301, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar249", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[305, 7, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator245", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler245", 
      "inputs": [[301, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar250", 
      "attr": {"scalar": "-1.0"}, 
      "inputs": [[305, 8, 0]]
    }, 
    {
      "op": "GridGenerator", 
      "name": "gridgenerator246", 
      "attr": {"transform_type": "warp"}, 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "BilinearSampler", 
      "name": "bilinearsampler246", 
      "inputs": [[301, 0, 0], [331, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat30", 
      "attr": {
        "dim": "1", 
        "num_args": "9"
      }, 
      "inputs": [[308, 0, 0], [311, 0, 0], [314, 0, 0], [317, 0, 0], [320, 0, 0], [323, 0, 0], [326, 0, 0], [329, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "fbrnn3_0__t7_h2h", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "576"
      }, 
      "inputs": [[333, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel40", 
      "attr": {
        "axis": "1", 
